GopalSaraf/Practicals/PSDL/include/proc/pic16f724.inc
// Register: PMDATH
#define PMDATH PMDATH
PMDATH                                   equ 010Eh

// Register: PMADRH
#define PMADRH PMADRH
PMADRH                                   equ 010Fh

// Register: ANSELA
#define ANSELA ANSELA
ANSELA                                   equ 0185h
// bitfield definitions
ANSELA_ANSA_POSN                         equ 0000h
ANSELA_ANSA_POSITION                     equ 0000h
ANSELA_ANSA_SIZE                         equ 0006h
ANSELA_ANSA_LENGTH                       equ 0006h
ANSELA_ANSA_MASK                         equ 003Fh
ANSELA_ANSA0_POSN                        equ 0000h
ANSELA_ANSA0_POSITION                    equ 0000h
ANSELA_ANSA0_SIZE                        equ 0001h
ANSELA_ANSA0_LENGTH                      equ 0001h
ANSELA_ANSA0_MASK                        equ 0001h
ANSELA_ANSA1_POSN                        equ 0001h
ANSELA_ANSA1_POSITION                    equ 0001h
ANSELA_ANSA1_SIZE                        equ 0001h
ANSELA_ANSA1_LENGTH                      equ 0001h
ANSELA_ANSA1_MASK                        equ 0002h
ANSELA_ANSA2_POSN                        equ 0002h
ANSELA_ANSA2_POSITION                    equ 0002h
ANSELA_ANSA2_SIZE                        equ 0001h
ANSELA_ANSA2_LENGTH                      equ 0001h
ANSELA_ANSA2_MASK                        equ 0004h
ANSELA_ANSA3_POSN                        equ 0003h
ANSELA_ANSA3_POSITION                    equ 0003h
ANSELA_ANSA3_SIZE                        equ 0001h
ANSELA_ANSA3_LENGTH                      equ 0001h
ANSELA_ANSA3_MASK                        equ 0008h
ANSELA_ANSA4_POSN                        equ 0004h
ANSELA_ANSA4_POSITION                    equ 0004h
ANSELA_ANSA4_SIZE                        equ 0001h
ANSELA_ANSA4_LENGTH                      equ 0001h
ANSELA_ANSA4_MASK                        equ 0010h
ANSELA_ANSA5_POSN                        equ 0005h
ANSELA_ANSA5_POSITION                    equ 0005h
ANSELA_ANSA5_SIZE                        equ 0001h
ANSELA_ANSA5_LENGTH                      equ 0001h
ANSELA_ANSA5_MASK                        equ 0020h

// Register: ANSELB
#define ANSELB ANSELB
ANSELB                                   equ 0186h
// bitfield definitions
ANSELB_ANSB_POSN                         equ 0000h
ANSELB_ANSB_POSITION                     equ 0000h
ANSELB_ANSB_SIZE                         equ 0006h
ANSELB_ANSB_LENGTH                       equ 0006h
ANSELB_ANSB_MASK                         equ 003Fh
ANSELB_ANSB0_POSN                        equ 0000h
ANSELB_ANSB0_POSITION                    equ 0000h
ANSELB_ANSB0_SIZE                        equ 0001h
ANSELB_ANSB0_LENGTH                      equ 0001h
ANSELB_ANSB0_MASK                        equ 0001h
ANSELB_ANSB1_POSN                        equ 0001h
ANSELB_ANSB1_POSITION                    equ 0001h
ANSELB_ANSB1_SIZE                        equ 0001h
ANSELB_ANSB1_LENGTH                      equ 0001h
ANSELB_ANSB1_MASK                        equ 0002h
ANSELB_ANSB2_POSN                        equ 0002h
ANSELB_ANSB2_POSITION                    equ 0002h
ANSELB_ANSB2_SIZE                        equ 0001h
ANSELB_ANSB2_LENGTH                      equ 0001h
ANSELB_ANSB2_MASK                        equ 0004h
ANSELB_ANSB3_POSN                        equ 0003h
ANSELB_ANSB3_POSITION                    equ 0003h
ANSELB_ANSB3_SIZE                        equ 0001h
ANSELB_ANSB3_LENGTH                      equ 0001h
ANSELB_ANSB3_MASK                        equ 0008h
ANSELB_ANSB4_POSN                        equ 0004h
ANSELB_ANSB4_POSITION                    equ 0004h
ANSELB_ANSB4_SIZE                        equ 0001h
ANSELB_ANSB4_LENGTH                      equ 0001h
ANSELB_ANSB4_MASK                        equ 0010h
ANSELB_ANSB5_POSN                        equ 0005h
ANSELB_ANSB5_POSITION                    equ 0005h
ANSELB_ANSB5_SIZE                        equ 0001h
ANSELB_ANSB5_LENGTH                      equ 0001h
ANSELB_ANSB5_MASK                        equ 0020h

// Register: ANSELD
#define ANSELD ANSELD
ANSELD                                   equ 0188h
// bitfield definitions
ANSELD_ANSD_POSN                         equ 0000h
ANSELD_ANSD_POSITION                     equ 0000h
ANSELD_ANSD_SIZE                         equ 0008h
ANSELD_ANSD_LENGTH                       equ 0008h
ANSELD_ANSD_MASK                         equ 00FFh
ANSELD_ANSD0_POSN                        equ 0000h
ANSELD_ANSD0_POSITION                    equ 0000h
ANSELD_ANSD0_SIZE                        equ 0001h
ANSELD_ANSD0_LENGTH                      equ 0001h
ANSELD_ANSD0_MASK                        equ 0001h
ANSELD_ANSD1_POSN                        equ 0001h
ANSELD_ANSD1_POSITION                    equ 0001h
ANSELD_ANSD1_SIZE                        equ 0001h
ANSELD_ANSD1_LENGTH                      equ 0001h
ANSELD_ANSD1_MASK                        equ 0002h
ANSELD_ANSD2_POSN                        equ 0002h
ANSELD_ANSD2_POSITION                    equ 0002h
ANSELD_ANSD2_SIZE                        equ 0001h
ANSELD_ANSD2_LENGTH                      equ 0001h
ANSELD_ANSD2_MASK                        equ 0004h
ANSELD_ANSD3_POSN                        equ 0003h
ANSELD_ANSD3_POSITION                    equ 0003h
ANSELD_ANSD3_SIZE                        equ 0001h
ANSELD_ANSD3_LENGTH                      equ 0001h
ANSELD_ANSD3_MASK                        equ 0008h
ANSELD_ANSD4_POSN                        equ 0004h
ANSELD_ANSD4_POSITION                    equ 0004h
ANSELD_ANSD4_SIZE                        equ 0001h
ANSELD_ANSD4_LENGTH                      equ 0001h
ANSELD_ANSD4_MASK                        equ 0010h
ANSELD_ANSD5_POSN                        equ 0005h
ANSELD_ANSD5_POSITION                    equ 0005h
ANSELD_ANSD5_SIZE                        equ 0001h
ANSELD_ANSD5_LENGTH                      equ 0001h
ANSELD_ANSD5_MASK                        equ 0020h
ANSELD_ANSD6_POSN                        equ 0006h
ANSELD_ANSD6_POSITION                    equ 0006h
ANSELD_ANSD6_SIZE                        equ 0001h
ANSELD_ANSD6_LENGTH                      equ 0001h
ANSELD_ANSD6_MASK                        equ 0040h
ANSELD_ANSD7_POSN                        equ 0007h
ANSELD_ANSD7_POSITION                    equ 0007h
ANSELD_ANSD7_SIZE                        equ 0001h
ANSELD_ANSD7_LENGTH                      equ 0001h
ANSELD_ANSD7_MASK                        equ 0080h

